/*
 * Copyright © 2016 Broadcom.
 * The term “Broadcom” refers to Broadcom Limited and/or its
 * subsidiaries.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation version 2.
 *
 * This program is distributed "as is" WITHOUT ANY WARRANTY of any
 * kind, whether express or implied; without even the implied warranty
 * of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 */

#ifndef _PM_CFG_DATA_H_
#define _PM_CFG_DATA_H_

#if defined(CHIMP_VIEW)
	#define PTR(x) (x *)
	#define CONST_PTR(x) (const x *)
#else
#define PTR(x) u32
#define CONST_PTR(x) u32
#endif

struct pm_phy_cfg;
/* Port Macro configuration */
typedef struct pm_phy_cfg {
	/* link speed in multiple of kMbps */
	u32 speed;
	/* mtu size in bytes */
	u16 mtu;
	/* physical port idx from 0 */
	u8 port_idx;
	u8 an_enabled;
	/* Autoneg Capability Mask */
	u16 autoneg_cap;
	#define PM_PHY_CFG_AUTONEG_CAP_100MBPS                  0x1
	#define PM_PHY_CFG_AUTONEG_CAP_1GBPS                    0x2
	#define PM_PHY_CFG_AUTONEG_CAP_2_5GBPS                  0x4
	#define PM_PHY_CFG_AUTONEG_CAP_10GBPS                   0x8
	#define PM_PHY_CFG_AUTONEG_CAP_20GBPS                  0x10
	#define PM_PHY_CFG_AUTONEG_CAP_25GBPS                  0x20
	#define PM_PHY_CFG_AUTONEG_CAP_40GBPS                  0x40
	#define PM_PHY_CFG_AUTONEG_CAP_50GBPS                  0x80
	/* bitfield indicates if tx/rx pause */
	u8 pause;
	/* rx pause enabled */
	#define PM_PHY_CFG_PAUSE_RX                             0x1
	/* tx pause enabled */
	#define PM_PHY_CFG_PAUSE_TX                             0x2
	/* PFC is enabled */
	#define PM_PHY_CFG_PAUSE_PFC_ENABLE                     0x4
	/* loopback mode */
	u8 lpbk;
	#define PM_PHY_CFG_LPBK_NONE                          (0x0)
	#define PM_PHY_CFG_LPBK_INT_PHY                       (0x1)
	#define PM_PHY_CFG_LPBK_EXT_PHY                       (0x2)
	#define PM_PHY_CFG_LPBK_EXT                           (0x3)
	#define PM_PHY_CFG_LPBK_MAC                           (0x4)
	/* phy core type */
	u8 core_type;
	/* For Cumulus */
	#define PM_PHY_CFG_CORE_TYPE_FALCON                   (0x0)
	/* For NS2 */
	#define PM_PHY_CFG_CORE_TYPE_EAGLE                    (0x1)
	/* same format as nvm cfg */
	u32 core_config;
	/* port mode */
	#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_MASK          0xff
	#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_SFT              0
		#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_1X10G   (0x0 << 0)
		#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_2X10G   (0x1 << 0)
		#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_4X10G   (0x2 << 0)
		#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_1X25G   (0x3 << 0)
		#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_2X25G   (0x4 << 0)
		#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_1X40G   (0x5 << 0)
		#define PM_PHY_CFG_CORE_CONFIG_PORT_MODE_1X50G   (0x6 << 0)
	/* preemphasis cfg setting */
	#define PM_PHY_CFG_CORE_CONFIG_PREEMPHASIS_CFG        0x100
		#define PM_PHY_CFG_CORE_CONFIG_PREEMPHASIS_CFG_DISABLED (0x0 << 8)
		#define PM_PHY_CFG_CORE_CONFIG_PREEMPHASIS_CFG_ENABLED (0x1 << 8)
	/* same format as nvm cfg */
	u32 lane_swap;
	#define PM_PHY_CFG_LANE_SWAP_RX_LANE0_MASK              0xf
	#define PM_PHY_CFG_LANE_SWAP_RX_LANE0_SFT                 0
	#define PM_PHY_CFG_LANE_SWAP_RX_LANE1_MASK             0xf0
	#define PM_PHY_CFG_LANE_SWAP_RX_LANE1_SFT                 4
	#define PM_PHY_CFG_LANE_SWAP_RX_LANE2_MASK            0xf00
	#define PM_PHY_CFG_LANE_SWAP_RX_LANE2_SFT                 8
	#define PM_PHY_CFG_LANE_SWAP_RX_LANE3_MASK           0xf000
	#define PM_PHY_CFG_LANE_SWAP_RX_LANE3_SFT                12
	#define PM_PHY_CFG_LANE_SWAP_TX_LANE0_MASK          0xf0000
	#define PM_PHY_CFG_LANE_SWAP_TX_LANE0_SFT                16
	#define PM_PHY_CFG_LANE_SWAP_TX_LANE1_MASK         0xf00000
	#define PM_PHY_CFG_LANE_SWAP_TX_LANE1_SFT                20
	#define PM_PHY_CFG_LANE_SWAP_TX_LANE2_MASK        0xf000000
	#define PM_PHY_CFG_LANE_SWAP_TX_LANE2_SFT                24
	#define PM_PHY_CFG_LANE_SWAP_TX_LANE3_MASK       0xf0000000
	#define PM_PHY_CFG_LANE_SWAP_TX_LANE3_SFT                28
	/* same format as nvm cfg */
	u32 lane_polarity;
	#define PM_PHY_CFG_LANE_POLARITY_RX_LANE0               0x1
	#define PM_PHY_CFG_LANE_POLARITY_RX_LANE1               0x2
	#define PM_PHY_CFG_LANE_POLARITY_RX_LANE2               0x4
	#define PM_PHY_CFG_LANE_POLARITY_RX_LANE3               0x8
	#define PM_PHY_CFG_LANE_POLARITY_TX_LANE0              0x10
	#define PM_PHY_CFG_LANE_POLARITY_TX_LANE1              0x20
	#define PM_PHY_CFG_LANE_POLARITY_TX_LANE2              0x40
	#define PM_PHY_CFG_LANE_POLARITY_TX_LANE3              0x80
	/* same format as nvm cfg */
	u32 preemphasis;
	#define PM_PHY_CFG_PREEMPHASIS_LANE0_MASK              0xff
	#define PM_PHY_CFG_PREEMPHASIS_LANE0_SFT                  0
	#define PM_PHY_CFG_PREEMPHASIS_LANE1_MASK            0xff00
	#define PM_PHY_CFG_PREEMPHASIS_LANE1_SFT                  8
	#define PM_PHY_CFG_PREEMPHASIS_LANE2_MASK          0xff0000
	#define PM_PHY_CFG_PREEMPHASIS_LANE2_SFT                 16
	#define PM_PHY_CFG_PREEMPHASIS_LANE3_MASK        0xff000000
	#define PM_PHY_CFG_PREEMPHASIS_LANE3_SFT                 24
	/* same format as nvm cfg */
	u32 driver_current;
	#define PM_PHY_CFG_DRIVER_CURRENT_LANE0_MASK           0xff
	#define PM_PHY_CFG_DRIVER_CURRENT_LANE0_SFT               0
	#define PM_PHY_CFG_DRIVER_CURRENT_LANE1_MASK         0xff00
	#define PM_PHY_CFG_DRIVER_CURRENT_LANE1_SFT               8
	#define PM_PHY_CFG_DRIVER_CURRENT_LANE2_MASK       0xff0000
	#define PM_PHY_CFG_DRIVER_CURRENT_LANE2_SFT              16
	#define PM_PHY_CFG_DRIVER_CURRENT_LANE3_MASK     0xff000000
	#define PM_PHY_CFG_DRIVER_CURRENT_LANE3_SFT              24
	/* same format as nvm cfg */
	u32 speed_cap_mask;
	#define PM_PHY_CFG_SPEED_CAP_MASK_DRV_1G                0x1
	#define PM_PHY_CFG_SPEED_CAP_MASK_DRV_10G               0x2
	#define PM_PHY_CFG_SPEED_CAP_MASK_DRV_25G               0x4
	#define PM_PHY_CFG_SPEED_CAP_MASK_DRV_40G               0x8
	#define PM_PHY_CFG_SPEED_CAP_MASK_DRV_50G              0x10
	#define PM_PHY_CFG_SPEED_CAP_MASK_FW_1G             0x10000
	#define PM_PHY_CFG_SPEED_CAP_MASK_FW_10G            0x20000
	#define PM_PHY_CFG_SPEED_CAP_MASK_FW_25G            0x40000
	#define PM_PHY_CFG_SPEED_CAP_MASK_FW_40G            0x80000
	#define PM_PHY_CFG_SPEED_CAP_MASK_FW_50G           0x100000
	/* same format as nvm cfg */
	u32 phy_cfg_mode;
	/* serdes network interface */
	#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_MASK       0xff
	#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_SFT           0
		#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_BYPASS (0x0 << 0)
		#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_KR   (0x1 << 0)
		#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_KR2  (0x2 << 0)
		#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_KR4  (0x3 << 0)
		#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_XFI  (0x4 << 0)
		#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_SFI  (0x5 << 0)
		#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_1000X (0x6 << 0)
		#define PM_PHY_CFG_PHY_CFG_MODE_SERDES_INTF_SGMII (0x7 << 0)
	#define PM_PHY_CFG_PHY_CFG_MODE_AN_MODE_MASK         0xff00
	#define PM_PHY_CFG_PHY_CFG_MODE_AN_MODE_SFT               8
		#define PM_PHY_CFG_PHY_CFG_MODE_AN_MODE_NONE     (0x0 << 8)
		#define PM_PHY_CFG_PHY_CFG_MODE_AN_MODE_CL73     (0x1 << 8)
		#define PM_PHY_CFG_PHY_CFG_MODE_AN_MODE_CL37     (0x2 << 8)
		#define PM_PHY_CFG_PHY_CFG_MODE_AN_MODE_CL73_BAM (0x3 << 8)
		#define PM_PHY_CFG_PHY_CFG_MODE_AN_MODE_CL37_BAM (0x4 << 8)
		#define PM_PHY_CFG_PHY_CFG_MODE_AN_MODE_SGMII    (0x5 << 8)
	/* optical module */
	#define PM_PHY_CFG_PHY_CFG_MODE_OPTIC_MODULE_MASK   0xff0000
	#define PM_PHY_CFG_PHY_CFG_MODE_OPTIC_MODULE_SFT         16
		#define PM_PHY_CFG_PHY_CFG_MODE_OPTIC_MODULE_I2C_SEL_0 (0x0 << 16)
		#define PM_PHY_CFG_PHY_CFG_MODE_OPTIC_MODULE_I2C_SEL_1 (0x1 << 16)
		#define PM_PHY_CFG_PHY_CFG_MODE_OPTIC_MODULE_I2C_SEL_2 (0x2 << 16)
		#define PM_PHY_CFG_PHY_CFG_MODE_OPTIC_MODULE_I2C_SEL_NA (0xff << 16)
	u32 core_addr;
	/* same format as nvm cfg */
	u32 sfp_ctrl;
	#define PM_PHY_CFG_SFP_CTRL_TX_LASER_MASK              0xff
	#define PM_PHY_CFG_SFP_CTRL_TX_LASER_SFT                  0
	#define PM_PHY_CFG_SFP_CTRL_MOD_ABS_MASK             0xff00
	#define PM_PHY_CFG_SFP_CTRL_MOD_ABS_SFT                   8
	#define PM_PHY_CFG_SFP_CTRL_PWR_DIS_MASK           0xff0000
	#define PM_PHY_CFG_SFP_CTRL_PWR_DIS_SFT                  16
	/* same format as nvm cfg */
	u32 qsfp_ctrl;
	#define PM_PHY_CFG_QSFP_CTRL_WRONG_MOD_TYPE_MASK       0xff
	#define PM_PHY_CFG_QSFP_CTRL_WRONG_MOD_TYPE_SFT           0
	#define PM_PHY_CFG_QSFP_CTRL_CUR_FAULT_MASK          0xff00
	#define PM_PHY_CFG_QSFP_CTRL_CUR_FAULT_SFT                8
	#define PM_PHY_CFG_QSFP_CTRL_LP_MODE_MASK          0xff0000
	#define PM_PHY_CFG_QSFP_CTRL_LP_MODE_SFT                 16
	#define PM_PHY_CFG_QSFP_CTRL_RESET_MASK          0xff000000
	#define PM_PHY_CFG_QSFP_CTRL_RESET_SFT                   24
	/* Board Config */
	u32 board_cfg;
	/* Board config#1 */
	u32 board_cfg1;
	/* PHY config */
	u32 ext_phy;
	/* MAC address */
	u8 mac_addr[6];
} pm_phy_cfg_t, *ppm_phy_cfg_t;

typedef struct pa_reg {
	void *pa_pm_sw_arb;	/* 0x250000 */
	/* Multi Field Register. */
#define PA_PM_ARB_REQ_SET_MASK                   0xfUL
#define PA_PM_ARB_REQ_SET_SFT                    0
	/*
	 * SW Arbitration Request Set Bits. To access the PM Registers,
	 * each agent must set it's Request bit and wait for the
	 * corresponding Grant bit to be set. Once Grant is set, that
	 * agent is given exclusive access to the PM Registers. When
	 * finished, the Request bit should be Cleared to allow other
	 * agents to access the PM. Agent[0] is the TimeStamp logic
	 * internal to the PA. Agent[3:1] are for different CPUs through
	 * the chip. These bits are self-clearing.
	 */
#define PA_PM_ARB_REQ_CLR_MASK                   0xf00UL
#define PA_PM_ARB_REQ_CLR_SFT                    8
	/*
	 * SW Arbitration Request Clear Bits. Once an Agent is finished
	 * accessing the PM Registers, it's Request must be cleared.
	 * These bits are self-clearing.
	 */
#define PA_PM_ARB_GRANT_BITS_MASK                0xf0000UL
#define PA_PM_ARB_GRANT_BITS_SFT                 16
	/*
	 * SW Arbitration Grant Bits. Only one of these bits will be set
	 * at any time. When Grant is set for a certain Agent, that
	 * Agent has exclusive access to the PM Registers. Once Granted,
	 * the Agent should assume all access control registers have
	 * been modified by other Agents and should be reconfigured.
	 */
#define PA_PM_ARB_REQUEST_BITS_MASK              0xf000000UL
#define PA_PM_ARB_REQUEST_BITS_SFT               24
	/*
	 * SW Arbitration Request Bits. These bits show which Agents are
	 * currently requesting access to the PM Registers.
	 */
	void *pa_pm_if_cmd;	/* 0x250004 */
	void *pa_pm_if_wctrl;	/* 0x250004 */
	void *pa_pm_if_rctrl;	/* 0x250004 */
	/* Multi Field Register. */
#define PA_PM_IF_TYPE                            0x1UL
#define PA_PM_IF_TYPE_MEMORY_ACCESS              (0x1UL << 0)
#define PA_PM_IF_TYPE_REGISTER_ACCESS            (0x0UL << 0)
#define PA_PM_IF_TYPE_ACCESS_SFT             (23)
#define PA_PM_IF_ADDR_AUTO_INC                   0x2UL
	/*
	 * Setting this bit to 1 tells the interface logic auto
	 * increment the address based on the programmed byte count. For
	 * Register operations, address bits [24:8] are incremented. For
	 * Memory operations, address bits [25:0] are incremented.
	 */
#define PA_PM_IF_ADDR_AUTO_INC_SIZE_MASK         0xf0UL
#define PA_PM_IF_ADDR_AUTO_INC_SIZE_SFT          4
	/*
	 * In Port Macro the register addresses are index addresses, a
	 * 64bit register is considered a single register, the next 64
	 * bit register will be at addr+1. This register allows HW to
	 * automatically increment to a programmable index. Normally the
	 * value will be just 1.
	 */
#define PA_PM_IF_BYTE_COUNT_MASK                 0xff00UL
#define PA_PM_IF_BYTE_COUNT_SFT                  24
	/* Byte Count of the transaction. Limit to 32bytes. */
#define PA_PM_IF_RESET_FSM                       0x10000UL
	/* Reset the Register interface state machine */
	void *pa_pm_if_wr_go;	/* 0x250008 */
	void *pa_pm_if_rd_go;	/* 0x250008 */
	void *pa_pm_if_status_mask;	/* 0x250008 */
	void *pa_pm_if_dbg_ctrl;	/* 0x250008 */
#define  PA_PM_IF_GO (0x1UL << 31)
	void *pa_pm_if_status;	/* 0x250008 */
	/* Multi Field Register. */
#define PA_PM_IF_BUSY                            0x1UL
#define PA_PM_IF_BUSY_BUSY                       (0x1UL << 0)
	/* State Machine is busy */
#define PA_PM_IF_RD_DONE                            (0x1UL << 31)
#define PA_PM_IF_DONE_COMPLETED                  (0x1UL << 1)
	/* State Machine has completed operation. */
#define PA_PM_IF_RD_ERROR                           (0x1UL << 30)
#define PA_PM_IF_ERROR_ERROR                     (0x1UL << 2)
	/* Last transaction resulted in an error */
#define PA_PM_IF_WR_DONE                            (0x1UL << 29)
#define PA_PM_IF_WR_ERROR                           (0x1UL << 28)
	void *pa_pm_if_waddr;	/* 0x25000c RW */
	void *pa_pm_if_raddr;	/* 0x25000c RW */
	/* Address of PM IF transaction. Fields: For Register Access */
#define PM_IF_ADDR_REG_STAGE_ID_MASK             0xfc000000UL
#define PM_IF_ADDR_REG_STAGE_ID_SFT              26
	/* reg_stage_id[31:26] :Stage ID */
#define PM_IF_ADDR_REG_TYPE                      0x2000000UL
	/* reg_type[25:25] :Register Type */
#define PM_IF_ADDR_REG_TYPE_PER_PORT             (0x0UL << 25)
	/* Per Port */
#define PM_IF_ADDR_REG_TYPE_GEN_REG              (0x1UL << 25)
	/* Generic Register */
#define PM_IF_ADDR_REG_OFFSET_MASK               0x1ffff00UL
#define PM_IF_ADDR_REG_OFFSET_SFT                8
	/* reg_offset[24:8] :Register Offset */
#define PM_IF_ADDR_PORT_NUM_MASK                 0xffUL
#define PM_IF_ADDR_PORT_NUM_SFT                  0
	/* port_num[7:0] :Port Number For Memory Access */
#define PM_IF_ADDR_MEM_STAGE_ID_MASK             0xfc000000UL
#define PM_IF_ADDR_MEM_STAGE_ID_SFT              26
	/* mem_stage_id[31:26] :Stage ID[5:0] */
#define PM_IF_ADDR_MEM_IDX_MASK                  0x3ffffffUL
#define PM_IF_ADDR_MEM_IDX_SFT                   0
	/* mem_idx[25:0] :Memory Index */
	void *pa_pm_if_wrdata;	/* 0x250010 RW */
	/*
	 * Write Data. This should be the last item written for a
	 * transaction. Writing to this register will kick off a
	 * transaction
	 */
	void *pa_pm_if_rddata;	/* 0x250014 RO */
	/* Read Data */
	void *pa_debug_cntl;	/* 0x250018 */
	/* Multi Field Register. */
#define PA_DEBUG_SEL_MASK                        0xffffUL
#define PA_DEBUG_SEL_SFT                         0
	/* Select Debug Status. */
#define PA_PM_MAX_CREDIT_MASK                    0xff0000UL
#define PA_PM_MAX_CREDIT_SFT                     16
	/* Maximum TX Credit from PortMacro. */
#define PA_PM_CREDIT_OVERFLOW_CTRL_EN            0x20000000UL
	/* Enable PortMacro TX Credit Overflow Prevention Logic. */
#define PA_TIMER_TEST_MODE                       0x40000000UL
	/* Purge Timer Test Mode, 100us pulse is shortened to 160ns. */
#define PA_DEBUG_EN                              0x80000000UL
	/* Enable Debug. */
	void *pa_debug_status;	/* 0x25001c RO */
	/* Debug Status. */
	/* ** Union ** PA_REG_DEBUG_CNTL[15:0] = 16'h0 debug_sel0_data */
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_MASK     0xffffffffUL
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_SFT      0
	/*
	 * pa_rf_debug_status[31:0]:Read Packet Counts:
	 * {rx_pkt_cnt[15:0], tx_pkt_cnt[15:0]}
	 */
	/* ** Union ** PA_REG_DEBUG_CNTL[15:0] = 16'h1 debug_sel1_data */
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_1_MASK   0xffffffffUL
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_1_SFT    0
	/*
	 * pa_rf_debug_status[31:0]:Read Signals for debug:
	 * {pa_chimp_idle_idle, data_state_idle[PORTS_NUM-1:0],
	 * rx_portq_overflow, rx_portq_underflow, rx_portq_full,
	 * tx_portq_full[PORTS_NUM-1:0], rx_portq_empty}
	 */
	/* ** Union ** PA_REG_DEBUG_CNTL[15:0] = 16'h2 debug_sel2_data */
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_2_MASK   0xffffffffUL
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_2_SFT    0
	/*
	 * pa_rf_debug_status[31:0]:Read Packet Counts:
	 * {port0_rx_pkt_cnt[15:0], port0_tx_pkt_cnt[15:0]}
	 */
	/* ** Union ** PA_REG_DEBUG_CNTL[15:0] = 16'h3 debug_sel3_data */
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_3_MASK   0xffffffffUL
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_3_SFT    0
	/*
	 * pa_rf_debug_status[31:0]:Read Packet Counts:
	 * {port1_rx_pkt_cnt[15:0], port1_tx_pkt_cnt[15:0]}
	 */
	/* ** Union ** PA_REG_DEBUG_CNTL[15:0] = 16'h4 debug_sel4_data */
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_4_MASK   0xffffffffUL
#define DEBUG_STATUS_PA_RF_DEBUG_STATUS_4_SFT    0
	/*
	 * pa_rf_debug_status[31:0]:Read Packet Counts:
	 * {port2_rx_pkt_cnt[15:0], port2_tx_pkt_cnt[15:0]}
	 */
	void *pa_loopback_port_byte_cnt;	/* 0x250020 */
	/* Multi Field Register. */
#define PA_STAT_BYTE_CNT_MASK                    0xffffffffUL
#define PA_STAT_BYTE_CNT_SFT                     0
	/* R2C, byte count for packets in loopback. */
	void *pa_loopback_port_pkt_cnt;	/* 0x250024 */
	/* Multi Field Register. */
#define PA_STAT_PKT_MASK                         0xffffffffUL
#define PA_STAT_PKT_SFT                          0
	/* R2C, packet count in loopback mode. */
	void *pa_loopback_bandwidth_cntl;	/* 0x250028 */
	/* Multi Field Register. */
#define PA_LPBK_BANDWIDTH_DIV_MASK               0xffUL
#define PA_LPBK_BANDWIDTH_DIV_SFT                0
	/* Divide count used to control loopback traffic bandwidth. */
	u64 unused_0[5];	/* 0x25002c - 0x25003c */
	void *pa_tx_port_watermark[3];	/* 0x250040 - 0x250048 RW */
	/*
	 * TX Port Watermark value. To compensate for FIFO lookahead
	 * mechanism, this value should be 1 less than the intended
	 * watermark value.
	 */
#define PA_TX_PORT_WATERMARK_MASK                0xffUL	/* Reset: 6 */
#define PA_TX_PORT_WATERMARK_SFT                 0
	u64 unused_1[5];	/* 0x25004c - 0x25005c */
	void *pa_port_config;	/* 0x250060 */
	/* Multi Field Register. */
#define PA_ENABLE_LOOPBACK                       0x1UL
	/* Enable loopback port. */
#define PA_ENABLE_LOOPBACK_CRC_PAD               0x2UL
	/* Enable loopback port CRC Padding. */
#define PA_ENABLE_LOOPBACK_INT_HDR_SKIP          0x4UL
	/*
	 * Enable 4-Byte Internal Header Skip on Loopback Port Packet
	 * Type Decoding Logic. This Packet Type is Used by the Status
	 * Tracking Block.
	 */
#define PA_LOOPBACK_PFC_EN                       0x8UL
	/* Loopback PFC Enable. */
#define PA_RXP_MAC_FC_CMB_EN                     0x10UL
	/*
	 * Enable Logic that Combines RXP and MAC Flow Control To
	 * Backpressure TX.
	 */
	/* Soft_init for each TX Port. */
#define PA_TX_PORT_INIT_RSVD_MASK                0xe000UL
#define PA_TX_PORT_INIT_RSVD_SFT                 13
	/* rsvd[15:13] :Reserved. */
#define PA_TX_PORT_INIT_TX_PORT4_RST             0x1000UL
	/* tx_port4_rst[12:12] :TX Port 4 Reset. */
#define PA_TX_PORT_INIT_TX_PORT3_RST             0x800UL
	/* tx_port3_rst[11:11] :TX Port 3 Reset. */
#define PA_TX_PORT_INIT_TX_PORT2_RST             0x400UL
	/* tx_port2_rst[10:10] :TX Port 2 Reset. */
#define PA_TX_PORT_INIT_TX_PORT1_RST             0x200UL
	/* tx_port1_rst[9:9] :TX Port 1 Reset. */
#define PA_TX_PORT_INIT_TX_PORT0_RST             0x100UL
	/* tx_port0_rst[8:8] :TX Port 0 Reset. */
#define PA_RX_INIT                               0x80000000UL
	/* Soft Reset for RX Logic. */
	void *pa_pbus_tstamp_rd_addr_config;	/* 0x250064 */
	/* Multi Field Register. */
#define PA_PBUS_TSTAMP_REG_OFFSET_MASK           0x1ffffUL
#define PA_PBUS_TSTAMP_REG_OFFSET_SFT            0
	/* FIFO 1588 Register Offset on PBUS. */
#define PA_PBUS_TSTAMP_STAGE_ID_MASK             0x3f00000UL
#define PA_PBUS_TSTAMP_STAGE_ID_SFT              20
	/* FIFO 1588 PBUS Access Stage ID. */
	void *pa_int_sts_0;	/* 0x250068 */
	/* Multi Field Register. */
#define PA_PORT0_TFIFO_WR                        0x1UL
	/* Port 0 Time Stamp FIFO Write Interrupt. */
#define PA_PORT1_TFIFO_WR                        0x2UL
	/* Port 1 Time Stamp FIFO Write Interrupt. */
#define PA_PORT2_TFIFO_WR                        0x4UL
	/* Port 2 Time Stamp FIFO Write Interrupt. */
#define PA_PORT3_TFIFO_WR                        0x8UL
	/* Port 3 Time Stamp FIFO Write Interrupt. */
#define PA_PBUS_ERROR                            0x10UL
	/* PBUS Access Error Interrupt. */
#define PA_PORT0_PURGE_TRUNC                     0x20UL
	/* Port 0 Purge Packet Truncate Interrupt. */
#define PA_PORT0_TIMEOUT                         0x40UL
	/* Port 0 Timer Timeout Interrupt. */
#define PA_PORT0_PURGE_DONE                      0x80UL
	/* Port 0 Purge Done Interrupt. */
#define PA_PORT1_PURGE_TRUNC                     0x100UL
	/* Port 1 Purge Packet Truncate Interrupt. */
#define PA_PORT1_TIMEOUT                         0x200UL
	/* Port 1 Timer Timeout Interrupt. */
#define PA_PORT1_PURGE_DONE                      0x400UL
	/* Port 1 Purge Done Interrupt. */
#define PA_PORT2_PURGE_TRUNC                     0x800UL
	/* Port 2 Purge Packet Truncate Interrupt. */
#define PA_PORT2_TIMEOUT                         0x1000UL
	/* Port 2 Timer Timeout Interrupt. */
#define PA_PORT2_PURGE_DONE                      0x2000UL
	/* Port 2 Purge Done Interrupt. */
#define PA_PORT3_PURGE_TRUNC                     0x4000UL
	/* Port 3 Purge Packet Truncate Interrupt. */
#define PA_PORT3_TIMEOUT                         0x8000UL
	/* Port 3 Timer Timeout Interrupt. */
#define PA_PORT3_PURGE_DONE                      0x10000UL
	/* Port 3 Purge Done Interrupt. */
#define PA_LINK_STATUS_CHANGE                    0x80000000UL
	/* Link Status Change Interrupt. */
	void *pa_int_mask_0;	/* 0x25006c */
	/* Multi Field Register. */
#define PA_PORT0_TFIFO_WR                        0x1UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT0_TFIFO_WR .
	 */
#define PA_PORT1_TFIFO_WR                        0x2UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT1_TFIFO_WR .
	 */
#define PA_PORT2_TFIFO_WR                        0x4UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT2_TFIFO_WR .
	 */
#define PA_PORT3_TFIFO_WR                        0x8UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT3_TFIFO_WR .
	 */
#define PA_PBUS_ERROR                            0x10UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PBUS_ERROR .
	 */
#define PA_PORT0_PURGE_TRUNC                     0x20UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT0_PURGE_TRUNC .
	 */
#define PA_PORT0_TIMEOUT                         0x40UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT0_TIMEOUT .
	 */
#define PA_PORT0_PURGE_DONE                      0x80UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT0_PURGE_DONE .
	 */
#define PA_PORT1_PURGE_TRUNC                     0x100UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT1_PURGE_TRUNC .
	 */
#define PA_PORT1_TIMEOUT                         0x200UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT1_TIMEOUT .
	 */
#define PA_PORT1_PURGE_DONE                      0x400UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT1_PURGE_DONE .
	 */
#define PA_PORT2_PURGE_TRUNC                     0x800UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT2_PURGE_TRUNC .
	 */
#define PA_PORT2_TIMEOUT                         0x1000UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT2_TIMEOUT .
	 */
#define PA_PORT2_PURGE_DONE                      0x2000UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT2_PURGE_DONE .
	 */
#define PA_PORT3_PURGE_TRUNC                     0x4000UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT3_PURGE_TRUNC .
	 */
#define PA_PORT3_TIMEOUT                         0x8000UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT3_TIMEOUT .
	 */
#define PA_PORT3_PURGE_DONE                      0x10000UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.PORT3_PURGE_DONE .
	 */
#define PA_LINK_STATUS_CHANGE                    0x80000000UL
	/*
	 * This bit masks, when set, the Interrupt bit:
	 * PA_REG_INT_STS_0.LINK_STATUS_CHANGE .
	 */
	void *pa_int_sts_wr_0;	/* 0x250070 */
	/* Multi Field Register. */
#define PA_PORT0_TFIFO_WR                        0x1UL
	/* Port 0 Time Stamp FIFO Write Interrupt. */
#define PA_PORT1_TFIFO_WR                        0x2UL
	/* Port 1 Time Stamp FIFO Write Interrupt. */
#define PA_PORT2_TFIFO_WR                        0x4UL
	/* Port 2 Time Stamp FIFO Write Interrupt. */
#define PA_PORT3_TFIFO_WR                        0x8UL
	/* Port 3 Time Stamp FIFO Write Interrupt. */
#define PA_PBUS_ERROR                            0x10UL
	/* PBUS Access Error Interrupt. */
#define PA_PORT0_PURGE_TRUNC                     0x20UL
	/* Port 0 Purge Packet Truncate Interrupt. */
#define PA_PORT0_TIMEOUT                         0x40UL
	/* Port 0 Timer Timeout Interrupt. */
#define PA_PORT0_PURGE_DONE                      0x80UL
	/* Port 0 Purge Done Interrupt. */
#define PA_PORT1_PURGE_TRUNC                     0x100UL
	/* Port 1 Purge Packet Truncate Interrupt. */
#define PA_PORT1_TIMEOUT                         0x200UL
	/* Port 1 Timer Timeout Interrupt. */
#define PA_PORT1_PURGE_DONE                      0x400UL
	/* Port 1 Purge Done Interrupt. */
#define PA_PORT2_PURGE_TRUNC                     0x800UL
	/* Port 2 Purge Packet Truncate Interrupt. */
#define PA_PORT2_TIMEOUT                         0x1000UL
	/* Port 2 Timer Timeout Interrupt. */
#define PA_PORT2_PURGE_DONE                      0x2000UL
	/* Port 2 Purge Done Interrupt. */
#define PA_PORT3_PURGE_TRUNC                     0x4000UL
	/* Port 3 Purge Packet Truncate Interrupt. */
#define PA_PORT3_TIMEOUT                         0x8000UL
	/* Port 3 Timer Timeout Interrupt. */
#define PA_PORT3_PURGE_DONE                      0x10000UL
	/* Port 3 Purge Done Interrupt. */
#define PA_LINK_STATUS_CHANGE                    0x80000000UL
	/* Link Status Change Interrupt. */
	u64 unused_2[3];	/* 0x250074 - 0x25007c */
	void *pa_port_tstamph[2];	/* 0x250080 - 0x250084 RO */
	/* Upper 32 bits of Timestamp */
	u64 unused_3[2];	/* 0x250088 - 0x25008c */
	void *pa_port_tstampl[2];	/* 0x250090 - 0x250094 RO */
	/* Lower 32 bits of Timestamp */
	u64 unused_4[2];	/* 0x250098 - 0x25009c */
	void *pa_port_seqid[2];	/* 0x2500a0 - 0x2500a4 RO */
	/* Sequence ID, reading this register causes the FIFO to advance. */
#define PA_PORT_SEQID_MASK                       0xffffUL	/* Reset: 0 */
#define PA_PORT_SEQID_SFT                        0
	u64 unused_5[2];	/* 0x2500a8 - 0x2500ac */
	void *pa_port_tfifo_stat[2];	/* 0x2500b0 - 0x2500b4 RW */
	/* Fields: */
#define PORT_TFIFO_STAT_FIFO_EMPTY               0x2UL
	/* FIFO_EMPTY[1:1] :Timestamp FIFO Empty. (RO) */
#define PORT_TFIFO_STAT_FIFO_FULL                0x1UL
	/* FIFO_FULL[0:0] :Timestamp FIFO Full. (RO) */
	u64 unused_6[2];	/* 0x2500b8 - 0x2500bc */
	void *pa_purge_timer_ns2_only[4];	/* 0x2500c0 - 0x2500cc RW */
	/*
	 * Reg removed in Cumulus!!! Purge Timeout Timer, Default is
	 * Equivalent to 10s.
	 */
	void *pa_purge_cntl_ns2_only[4];	/* 0x2500d0 - 0x2500dc RW */
	/* Reg removed in Cumulus!!! Fields: */
#define PA_PURGE_CNTL_NS2_ONLY_PURGE_STAT        0x4UL
	/*
	 * PURGE_STAT[2:2] :Set by HW when Purge Starts, SW Writes 1 to
	 * Stop Purge and Clear bit. (WC)
	 */
#define PA_PURGE_CNTL_NS2_ONLY_PURGE_EN          0x2UL
	/* PURGE_EN[1:1] :Enable Packet Drop after Timeout. (RW) */
#define PA_PURGE_CNTL_NS2_ONLY_TIMER_EN          0x1UL
	/* TIMER_EN[0:0] :Enable Timer for Purge Timeout. (RW) */
	void *pa_purge_cnt_ns2_only[4];	/* 0x2500e0 - 0x2500ec RW */
	/* Reg removed in Cumulus!!! Fields: */
#define PA_PURGE_CNT_NS2_ONLY_PA_PURGE_CNT_MASK  0xffffUL
#define PA_PURGE_CNT_NS2_ONLY_PA_PURGE_CNT_SFT   0
	/* PA_PURGE_CNT[15:0] :Purge Packet Count. (W0C) */
	u64 unused_7[4];	/* 0x2500f0 - 0x2500fc */
	void *pa_purge_timer_new[3];	/* 0x250100 - 0x250108 RW */
	/* Purge Timeout Timer, Default is Equivalent to 10s. */
	u64 unused_8[61];	/* 0x25010c - 0x2501fc */
	void *pa_purge_cntl_new[3];	/* 0x250200 - 0x250208 RW */
	/* Fields: */
#define PA_PURGE_CNTL_NEW_PURGE_STAT             0x4UL
	/*
	 * PURGE_STAT[2:2] :Set by HW when Purge Starts, SW Writes 1 to
	 * Stop Purge and Clear bit. (WC)
	 */
#define PA_PURGE_CNTL_NEW_PURGE_EN               0x2UL
	/* PURGE_EN[1:1] :Enable Packet Drop after Timeout. (RW) */
#define PA_PURGE_CNTL_NEW_TIMER_EN               0x1UL
	/* TIMER_EN[0:0] :Enable Timer for Purge Timeout. (RW) */
	u64 unused_9[61];	/* 0x25020c - 0x2502fc */
	void *pa_purge_cnt_new[3];	/* 0x250300 - 0x250308 RW */
	/* Fields: */
#define PA_PURGE_CNT_NEW_PA_PURGE_CNT_MASK       0xffffUL
#define PA_PURGE_CNT_NEW_PA_PURGE_CNT_SFT        0
	/* PA_PURGE_CNT[15:0] :Purge Packet Count. (W0C) */
	u64 unused_10[829];	/* 0x25030c - 0x250ffc */
	void *pa_dbg_select;	/* 0x251000 RW */
	/* DBMUX register for selecting a line to output */
#define PA_DBG_SELECT_MASK                       0xffUL	/* Reset: 0 */
#define PA_DBG_SELECT_SFT                        0
	void *pa_dbg_dword_enable;	/* 0x251004 RW */
	/*
	 * DBMUX register. Bit mask for enabling dword (128bit line) /
	 * qword (256bit line) in the selected line (before shift).for
	 * selecting a line to output
	 */
#define PA_DBG_DWORD_ENABLE_MASK                 0xfUL	/* Reset: 0 */
#define PA_DBG_DWORD_ENABLE_SFT                  0
	void *pa_dbg_shift;	/* 0x251008 RW */
	/*
	 * DBMUX register. Circular dword (128bit line) / qword (256bit
	 * line) right shifting of the selected line (after the
	 * masking).
	 */
#define PA_DBG_SHIFT_MASK                        0x3UL	/* Reset: 0 */
#define PA_DBG_SHIFT_SFT                         0
	void *pa_dbg_force_valid;	/* 0x25100c RW */
	/*
	 * DBMUX register. Bit mask for forcing the valid signal per
	 * dword (128bit line) / qword (256bit line) (before shift).
	 */
#define PA_DBG_FORCE_VALID_MASK                  0xfUL	/* Reset: 0 */
#define PA_DBG_FORCE_VALID_SFT                   0
	void *pa_dbg_force_frame;	/* 0x251010 RW */
	/*
	 * DBMUX register. bit mask for forcing the frame signal per
	 * dword (128bit line) / qword (256bit line) (before shift).
	 */
#define PA_DBG_FORCE_FRAME_MASK                  0xfUL	/* Reset: 0 */
#define PA_DBG_FORCE_FRAME_SFT                   0
	u64 unused_11[3];	/* 0x251014 - 0x25101c */
	void *pa_dbg_out_data[8];	/* 0x251020 - 0x25103c RO */
	/* "Wide-Bus" register. Dbgmux output data */
	void *pa_dbg_out_valid;	/* 0x251040 RO */
	/* Dbgmux output valid */
#define PA_DBG_OUT_VALID_MASK                    0xfUL	/* Reset: 0 */
#define PA_DBG_OUT_VALID_SFT                     0
	void *pa_dbg_out_frame;	/* 0x251044 RO */
	/* Dbgmux output frame */
#define PA_DBG_OUT_FRAME_MASK                    0xfUL	/* Reset: 0 */
#define PA_DBG_OUT_FRAME_SFT                     0
	void *pa_eco_reserved;	/* 0x251048 RW */
	/* reserved bits for ECOs */
#define PA_ECO_RESERVED_MASK                     0xffffUL	/* Reset: 0 */
#define PA_ECO_RESERVED_SFT                      0
	void *pa_pm_if_timeout_val;	/* 0x25104c RW */
	/*
	 * This register contains a Timeout Value for PBUS Transactions.
	 * If there is no response to a PBus Read/Write after this
	 * number of cycles, the transaction is terminated and marked as
	 * an error.
	 */
#define PA_PM_IF_TIMEOUT_VAL_MASK                0x3ffUL	/* Reset: 100 */
#define PA_PM_IF_TIMEOUT_VAL_SFT                 0
	u64 unused_12[4];	/* 0x251050 - 0x25105c */
	void *pa_per_port_cntl[3];	/* 0x251060 - 0x251068 RW */
	/* Fields: */
#define PER_PORT_CNTL_RXP_CNTL_PKT_FILTER_EN     0x10UL
	/*
	 * RXP_CNTL_PKT_FILTER_EN[4:4]:Per Panel Port RXP Control Packet
	 * Filter Enable.
	 */
#define PER_PORT_CNTL_RXP_PFC_PKT_FILTER_EN      0x8UL
	/*
	 * RXP_PFC_PKT_FILTER_EN[3:3]:Per Panel Port RXP PFC Packet
	 * Filter Enable.
	 */
#define PER_PORT_CNTL_RXP_PAUSE_PKT_FILTER_EN    0x4UL
	/*
	 * RXP_PAUSE_PKT_FILTER_EN[2:2]:Per Panel Port RXP Pause Packet
	 * Filter Enable.
	 */
#define PER_PORT_CNTL_RXP_BRCM_HDR_EN            0x2UL
	/*
	 * RXP_BRCM_HDR_EN[1:1]:Per Port Broadcom Header Handling Enable
	 * for RX Path.
	 */
#define PER_PORT_CNTL_TXP_BRCM_HDR_EN            0x1UL
	/*
	 * TXP_BRCM_HDR_EN[0:0]:Per Port Broadcom Header Handling Enable
	 * for TX Path.
	 */
	u64 unused_13[5];	/* 0x25106c - 0x25107c */
	void *pa_per_panel_port_mapping[3];	/* 0x251080 - 0x251088 RW */
	/* Fields: */
#define PER_PANEL_PORT_MAPPING_PM_PORT_MAP_MASK  0xfUL
#define PER_PANEL_PORT_MAPPING_PM_PORT_MAP_SFT   0
	/*
	 * PM_PORT_MAP[3:0] :Per Port Macro TX Port or Loopback Port
	 * Mapping. Default is TXP0 to PM Port0, TXP1 to PM Port1, TXP2
	 * to Loopback Port when Loopback is enabled.
	 */
	u64 unused_14[5];	/* 0x25108c - 0x25109c */
	void *pa_ep_to_port_regen_crc_const;	/* 0x2510a0 RW */
	/* Regenerate CRC */
#define PA_EP_TO_PORT_REGEN_CRC_CONST            0x1UL	/* Reset: 0 */
	void *pa_port_enable_status;	/* 0x2510a4 RO */
	/* Port Enable Status from Port Macro. */
#define PA_PORT_ENABLE_STATUS_MASK               0x7UL	/* Reset: 0 */
#define PA_PORT_ENABLE_STATUS_SFT                0
	void *pa_port_to_ep_port_mode;	/* 0x2510a8 RO */
	/* Number of ports supported by Port Macro. */
#define PA_PORT_TO_EP_PORT_MODE_MASK             0xfUL	/* Reset: 0 */
#define PA_PORT_TO_EP_PORT_MODE_SFT              0
	void *pa_pm4x25_lane_0_status;	/* 0x2510ac RO */
	/* Status of the port. */
#define PA_PM4X25_LANE_0_STATUS_MASK             0x7UL	/* Reset: 0 */
#define PA_PM4X25_LANE_0_STATUS_SFT              0
	void *pa_pm4x25_lane_1_status;	/* 0x2510b0 RO */
	/* Status of the port. */
#define PA_PM4X25_LANE_1_STATUS_MASK             0x7UL	/* Reset: 0 */
#define PA_PM4X25_LANE_1_STATUS_SFT              0
	void *pa_pm4x25_lane_2_status;	/* 0x2510b4 RO */
	/* Status of the port. */
#define PA_PM4X25_LANE_2_STATUS_MASK             0x7UL	/* Reset: 0 */
#define PA_PM4X25_LANE_2_STATUS_SFT              0
	u64 unused_15[6];	/* 0x2510b8 - 0x2510cc */
	void *pa_port_to_ip_port_mode;	/* 0x2510d0 RO */
	/* Number of ports supported by Port Macro. */
#define PA_PORT_TO_IP_PORT_MODE_MASK             0xfUL	/* Reset: 0 */
#define PA_PORT_TO_IP_PORT_MODE_SFT              0
	void *pa_link_status;	/* 0x2510d4 */
	/* Multi Field Register. */
#define PA_LINK_STATUS_MASK                      0xfUL
#define PA_LINK_STATUS_SFT                       0
	/* Link Status from Port Macro. */
	u64 unused_16[2];	/* 0x2510d8 - 0x2510dc */
	void *pa_per_rx_port_mapping[3];	/* 0x2510e0 - 0x2510e8 RW */
	/* Fields: */
#define PER_RX_PORT_MAPPING_RX_PORT_MAP_MASK     0xfUL
#define PER_RX_PORT_MAPPING_RX_PORT_MAP_SFT      0
	/*
	 * RX_PORT_MAP[3:0] :Per RXP Port from Port Macro or Loopback
	 * Port Mapping. Default is RXP0 from PM Port0, RXP1 from PM
	 * Port1, RXP2 from Loopback Port when Loopback is enabled.
	 */
	u64 unused_17[965];	/* 0x2510ec - 0x251ffc */
} pa_reg_t;

/* #define PM_WAIT(pdev,uS) udelay(uS) */

#define CHECK_PA_REG_BLK()    (sizeof(pa_reg_t) == 0x2000 && ROFFSET(pa) == 0x250000)
#define PA(x)  (pa.pa_##x)

extern void *apb2pbus_base;

#define APB2PBUS_BASE 0x204d0000
#define APB2PBUS_CTRL_OFFSET (0x0)
#define APB2PBUS_WADDR_OFFSET (0x4)
#define APB2PBUS_WDATA0_OFFSET (0x8)
#define APB2PBUS_WDATA1_OFFSETSET 0x00c
#define APB2PBUS_WCTRL_OFFSETSET 0x028
#define APB2PBUS_WR_GO_OFFSET 0x02c
#define APB2PBUS_RADDR_OFFSET 0x030
#define APB2PBUS_RDATA0_OFFSET 0x034
#define APB2PBUS_RDATA1_OFFSET 0x038
#define APB2PBUS_RCTRL_OFFSET 0x054
#define APB2PBUS_RD_GO_OFFSET 0x058
#define APB2PBUS_RD_WR_STATUS_OFFSET 0x05c
#define APB2PBUS_RD_WR_STATUS_MASK_OFFSET 0x060

#define ETH_SS_0_PORT_ENABLE 0x204e0040

#define XLMAC_PFC_CTRL_RX_PFC_EN_HI 36
#define XLMAC_PFC_CTRL_TX_PFC_EN_HI 37
#define XLMAC_PFC_CTRL_PFC_REFRESH_EN_HI 32

#define ETH_SS_0_PORT_MACRO_EEE_CONFIG 0x204f0004

